# CannotRegenFamily Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures..::..CannotRegenFamily Property
BuiltInFailures..::..RegenFailures Class See Also
---
Can't regenerate Family [Family Name]. Edit Family to modify it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotRegenFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotRegenFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotRegenFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RegenFailures Class
Autodesk.Revit.DB Namespace